nlbutts/cc1352_mini_board/software/tirtos_builds_CC1352P1_LAUNCHXL_release_gcc/Debug/configPkg/package/cfg/release_pm4fg.c
/*
 * ======== ROM STRUCTURES ========
 */

/* CT__constStruct */
typedef struct {
    CT__xdc_runtime_Error_policy xdc_runtime_Error_policy__R;
    xdc_runtime_Types_Base xdc_runtime_IModule_Interface__BASE__R;
    CT__xdc_runtime_Startup_lastFxns xdc_runtime_Startup_lastFxns__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Event_Object__DESC__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_gates_GateMutex_Object__DESC__R;
    CT__xdc_runtime_Startup_execImpl xdc_runtime_Startup_execImpl__R;
    xdc_SizeT ti_sysbios_gates_GateMutex_Instance_State_sem__O;
    CT__ti_sysbios_knl_Swi_Object__count ti_sysbios_knl_Swi_Object__count__R;
    CT__ti_sysbios_knl_Idle_funcList ti_sysbios_knl_Idle_funcList__R;
    CT__xdc_runtime_Text_isLoaded xdc_runtime_Text_isLoaded__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Clock_Object__DESC__R;
    xdc_SizeT ti_sysbios_knl_Mailbox_Instance_State_dataQue__O;
    CT__ti_sysbios_knl_Semaphore_eventSync ti_sysbios_knl_Semaphore_eventSync__R;
    ti_sysbios_gates_GateMutex_Fxns__ ti_sysbios_gates_GateMutex_Module__FXNS__R;
    xdc_SizeT ti_sysbios_knl_Task_Module_State_inactiveQ__O;
    CT__ti_sysbios_family_arm_m3_Hwi_Module__id ti_sysbios_family_arm_m3_Hwi_Module__id__R;
    CT__ti_sysbios_family_arm_cc26xx_Timer_Module__id ti_sysbios_family_arm_cc26xx_Timer_Module__id__R;
    CT__ti_sysbios_knl_Mailbox_Object__table ti_sysbios_knl_Mailbox_Object__table__R;
    CT__ti_sysbios_family_arm_m3_Hwi_Object__table ti_sysbios_family_arm_m3_Hwi_Object__table__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Swi_Object__DESC__R;
    CT__xdc_runtime_Text_charCnt xdc_runtime_Text_charCnt__R;
    CT__xdc_runtime_Error_raiseHook xdc_runtime_Error_raiseHook__R;
    CT__ti_sysbios_heaps_HeapMem_Object__table ti_sysbios_heaps_HeapMem_Object__table__R;
    CT__xdc_runtime_Error_policyFxn xdc_runtime_Error_policyFxn__R;
    CT__xdc_runtime_Startup_firstFxns xdc_runtime_Startup_firstFxns__R;
    CT__xdc_runtime_Text_charTab xdc_runtime_Text_charTab__R;
    CT__xdc_runtime_Error_maxDepth xdc_runtime_Error_maxDepth__R;
    CT__ti_sysbios_family_arm_m3_TaskSupport_stackAlignment ti_sysbios_family_arm_m3_TaskSupport_stackAlignment__R;
    CT__ti_sysbios_family_arm_m3_Hwi_NUM_INTERRUPTS ti_sysbios_family_arm_m3_Hwi_NUM_INTERRUPTS__R;
    CT__ti_sysbios_knl_Clock_triggerClock ti_sysbios_knl_Clock_triggerClock__R;
    CT__ti_sysbios_knl_Swi_Object__table ti_sysbios_knl_Swi_Object__table__R;
    CT__xdc_runtime_Memory_Module__id xdc_runtime_Memory_Module__id__R;
    CT__ti_sysbios_heaps_HeapMem_Module__gateObj ti_sysbios_heaps_HeapMem_Module__gateObj__R;
    CT__ti_sysbios_family_arm_cc26xx_Timer_startupNeeded ti_sysbios_family_arm_cc26xx_Timer_startupNeeded__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Queue_Object__DESC__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Task_Object__DESC__R;
    CT__xdc_runtime_Assert_E_assertFailed xdc_runtime_Assert_E_assertFailed__R;
    CT__ti_sysbios_gates_GateHwi_Module__id ti_sysbios_gates_GateHwi_Module__id__R;
    xdc_runtime_Types_Base xdc_runtime_IHeap_Interface__BASE__R;
    CT__xdc_runtime_SysCallback_exitFxn xdc_runtime_SysCallback_exitFxn__R;
    CT__ti_sysbios_heaps_HeapMem_Module__id ti_sysbios_heaps_HeapMem_Module__id__R;
    CT__ti_sysbios_family_arm_m3_Hwi_excHandlerFunc ti_sysbios_family_arm_m3_Hwi_excHandlerFunc__R;
    ti_sysbios_heaps_HeapMem_Fxns__ ti_sysbios_heaps_HeapMem_Module__FXNS__R;
    CT__xdc_runtime_System_maxAtexitHandlers xdc_runtime_System_maxAtexitHandlers__R;
    CT__ti_sysbios_knl_Queue_Object__count ti_sysbios_knl_Queue_Object__count__R;
    CT__ti_sysbios_knl_Task_Object__table ti_sysbios_knl_Task_Object__table__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Mailbox_Object__DESC__R;
    CT__ti_sysbios_family_arm_m3_Hwi_nullIsrFunc ti_sysbios_family_arm_m3_Hwi_nullIsrFunc__R;
    CT__ti_sysbios_knl_Clock_tickMode ti_sysbios_knl_Clock_tickMode__R;
    CT__ti_sysbios_gates_GateMutex_Module__id ti_sysbios_gates_GateMutex_Module__id__R;
    CT__ti_sysbios_knl_Swi_numPriorities ti_sysbios_knl_Swi_numPriorities__R;
    CT__ti_sysbios_knl_Task_numConstructedTasks ti_sysbios_knl_Task_numConstructedTasks__R;
    CT__xdc_runtime_Startup_maxPasses xdc_runtime_Startup_maxPasses__R;
    CT__ti_sysbios_knl_Task_initStackFlag ti_sysbios_knl_Task_initStackFlag__R;
    CT__xdc_runtime_System_abortFxn xdc_runtime_System_abortFxn__R;
    xdc_SizeT ti_sysbios_knl_Mailbox_Instance_State_dataSem__O;
    ti_sysbios_gates_GateHwi_Fxns__ ti_sysbios_gates_GateHwi_Module__FXNS__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_hal_Hwi_Object__DESC__R;
    CT__ti_sysbios_family_arm_m3_Hwi_priGroup ti_sysbios_family_arm_m3_Hwi_priGroup__R;
    CT__xdc_runtime_Error_E_memory xdc_runtime_Error_E_memory__R;
    CT__ti_sysbios_family_arm_m3_Hwi_E_alreadyDefined ti_sysbios_family_arm_m3_Hwi_E_alreadyDefined__R;
    xdc_SizeT ti_sysbios_knl_Mailbox_Instance_State_freeSem__O;
    CT__ti_sysbios_knl_Queue_Object__table ti_sysbios_knl_Queue_Object__table__R;
    CT__ti_sysbios_knl_Semaphore_eventPost ti_sysbios_knl_Semaphore_eventPost__R;
    CT__xdc_runtime_System_exitFxn xdc_runtime_System_exitFxn__R;
    CT__ti_sysbios_heaps_HeapMem_reqAlign ti_sysbios_heaps_HeapMem_reqAlign__R;
    CT__xdc_runtime_Startup_sfxnRts xdc_runtime_Startup_sfxnRts__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_knl_Semaphore_Object__DESC__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_gates_GateHwi_Object__DESC__R;
    CT__ti_sysbios_heaps_HeapMem_Object__count ti_sysbios_heaps_HeapMem_Object__count__R;
    CT__ti_sysbios_family_arm_m3_Hwi_numSparseInterrupts ti_sysbios_family_arm_m3_Hwi_numSparseInterrupts__R;
    CT__ti_sysbios_knl_Mailbox_maxTypeAlign ti_sysbios_knl_Mailbox_maxTypeAlign__R;
    CT__ti_sysbios_family_arm_cc26xx_TimestampProvider_useClockTimer ti_sysbios_family_arm_cc26xx_TimestampProvider_useClockTimer__R;
    xdc_SizeT ti_sysbios_knl_Event_Instance_State_pendQ__O;
    CT__ti_sysbios_knl_Task_allBlockedFunc ti_sysbios_knl_Task_allBlockedFunc__R;
    CT__ti_sysbios_knl_Mailbox_Object__count ti_sysbios_knl_Mailbox_Object__count__R;
    CT__xdc_runtime_Text_nameStatic xdc_runtime_Text_nameStatic__R;
    xdc_SizeT ti_sysbios_knl_Clock_Module_State_clockQ__O;
    CT__ti_sysbios_knl_Task_defaultStackSize ti_sysbios_knl_Task_defaultStackSize__R;
    xdc_runtime_Types_Base xdc_runtime_IGateProvider_Interface__BASE__R;
    CT__ti_sysbios_family_arm_m3_Hwi_E_hwiLimitExceeded ti_sysbios_family_arm_m3_Hwi_E_hwiLimitExceeded__R;
    CT__xdc_runtime_Startup_startModsFxn xdc_runtime_Startup_startModsFxn__R;
    xdc_SizeT ti_sysbios_knl_Semaphore_Instance_State_pendQ__O;
    xdc_runtime_Core_ObjDesc ti_sysbios_family_arm_m3_Hwi_Object__DESC__R;
    CT__xdc_runtime_Text_nameEmpty xdc_runtime_Text_nameEmpty__R;
    CT__ti_sysbios_family_arm_m3_Hwi_Object__count ti_sysbios_family_arm_m3_Hwi_Object__count__R;
    CT__xdc_runtime_SysCallback_abortFxn xdc_runtime_SysCallback_abortFxn__R;
    CT__ti_sysbios_knl_Task_defaultStackHeap ti_sysbios_knl_Task_defaultStackHeap__R;
    CT__ti_sysbios_family_arm_m3_Hwi_ccr ti_sysbios_family_arm_m3_Hwi_ccr__R;
    CT__ti_sysbios_heaps_HeapMem_E_memory ti_sysbios_heaps_HeapMem_E_memory__R;
    CT__ti_sysbios_knl_Task_Object__count ti_sysbios_knl_Task_Object__count__R;
    xdc_runtime_Core_ObjDesc ti_sysbios_heaps_HeapMem_Object__DESC__R;
    CT__xdc_runtime_Text_nameUnknown xdc_runtime_Text_nameUnknown__R;
    CT__xdc_runtime_Memory_defaultHeapInstance xdc_runtime_Memory_defaultHeapInstance__R;
    xdc_SizeT ti_sysbios_knl_Mailbox_Instance_State_freeQue__O;
    CT__xdc_runtime_Startup_sfxnTab xdc_runtime_Startup_sfxnTab__R;
} CT__constStruct;


/* TROM__stateStruct */
typedef struct {
    ti_sysbios_knl_Clock_Module_State__ ti_sysbios_knl_Clock_Module__state__V;
    ti_sysbios_family_arm_cc26xx_TimestampProvider_Module_State__ ti_sysbios_family_arm_cc26xx_TimestampProvider_Module__state__V;
    xdc_runtime_Startup_Module_State__ xdc_runtime_Startup_Module__state__V;
    ti_sysbios_BIOS_Module_State__ ti_sysbios_BIOS_Module__state__V;
    ti_sysbios_knl_Swi_Module_State__ ti_sysbios_knl_Swi_Module__state__V;
    ti_sysbios_knl_Task_Module_State__ ti_sysbios_knl_Task_Module__state__V;
    xdc_runtime_Memory_Module_State__ xdc_runtime_Memory_Module__state__V;
    xdc_runtime_System_Module_State__ xdc_runtime_System_Module__state__V;
    ti_sysbios_family_arm_m3_Hwi_Module_State__ ti_sysbios_family_arm_m3_Hwi_Module__state__V;
    xdc_runtime_Error_Module_State__ xdc_runtime_Error_Module__state__V;
    ti_sysbios_family_arm_cc26xx_Timer_Module_State__ ti_sysbios_family_arm_cc26xx_Timer_Module__state__V;
} TROM__stateStruct;

